{"data":"<h1 id=\"-alcojs\">Особенности AlcoJS</h1>\n<h2 id=\"-localstorage\">Хранение данных в LocalStorage</h2>\n<p>AlcoJS хранит все данные в браузере, чтобы избежать их передачи на сервер при каждом запросе (как происходит, при использовании кук, для хранения используется хранилище LocalStorage, которое поддерживается 97+% браузеров.</p>\n<p>Но есть особенности LocalStorage:</p>\n<ul>\n<li>www.вашсайт и вашсайт - для LocalStorage это разные сайты с разным хранилищем.</li>\n<li>http://вашсайт и https://вашсайт опять-таки разные сайты с разным хранилищем</li>\n</ul>\n<p>Для большинства сайтов это не будет проблемой, т.к. используется https (с редиректом с http), аналогичная ситуация с www.</p>\n<p>Известные проблемы, связанные с использованием LocalStorage:</p>\n<ul>\n<li>Не работает в режиме инкогнито</li>\n</ul>\n<p>В любом случае не нужно пугаться, даже если какие-то данные окажутся на разных доменах, все равно, все они будут собраны на основе uid (alco user id), для храниения которого используются кука.</p>\n<h2 id=\"-\">Транспорт</h2>\n<p>В Rockstat используется несколько различных подходов, для передачи данных на сервер.</p>\n<h3 id=\"sendbeacon\">sendBeacon</h3>\n<p>Самый новый метод передачи данных на сервер, доставка происходит даже при закрытии страницы, но связь односторонняя т.е. с сервера ответ не получить. Используется по-умолчанию в случае доступности в браузере.</p>\n<h3 id=\"xmlhttprequest\">XMLHttpRequest</h3>\n<p>Стандартный механизм передачи данных, используемый повсеместно. Используется для передечи большинства данных на сервер, при недоступном sendBeacon</p>\n<h3 id=\"xdomainrequest\">XDomainRequest</h3>\n<p>Модификация XMLHttpRequest c поддержкой CORS (cross-origin requests) в IE 9.</p>\n<h3 id=\"image\">Image</h3>\n<p>Обычная картинка с параметрами. Используется как резервкный транспорт, либо при отсутствии sendBeacon и отправке события, которое может вызвать закрытие страницы. Это связано с тем, что браузеры корректно обрабатывают вызов картинки и unload, в то время, как XMLHttpRequest либо обрывается либо вовсе не отправляется. Кол-во информации, которую можно передать данным способом сильно ограничего, поэтому сообщение на сервер значительно урезается и остаются только самые важные параметры.</p>\n<h3 id=\"websocket\">WebSocket</h3>\n<p>Имеется поддержка, но в данный момент не используется.</p>\n<h2 id=\"-spa\">Поддержка SPA</h2>\n<p>!&gt; Preview status</p>\n<p>Заложена базовая поддержка, но не все модули подготоволены к обнулению показателей при вызове alco(&#39;page&#39;). Если потребуется гарантированная работа, обращайтесь к разработчикам.</p>\n"}