{"data":"<h1 id=\"-\">Обзор инструментов для работы с данными</h1>\n<p>При установке платформы вы получаете из коробки набор инструментов, предназначенных для решения различных задач.</p>\n<h1 id=\"grafana\">Grafana</h1>\n<p>Очень удобный инструмент для создания дашбордов любой сложности. Помимо дашбордов, позволяет настраивать алерты на критическое изменение показателей, которые могут отправляться во множество каналов, например, почту, slack или telegram</p>\n<p><img src=\"/static/media/data_tools/grafana_screenshot.png\" alt=\"\"></p>\n<p>Grafana работает напрямую с ClickHouse, использует сырые данные о каждом отдельном событии. Все работает real-time.</p>\n<p><a href=\"doc:grafana\">Подробнее про использование Grafana</a></p>\n<h1 id=\"anaconda-jupyter-pandas-sk-learn-\">Anaconda: Jupyter + Pandas + sk-learn + др</h1>\n<p>Продвинутое решение для анализа данных, машинного обучения и визуализации данных.</p>\n<p>В комплекте уже идет библиотека для подключения к ClickHouse, вам остается лишь работать с данными.</p>\n<p><img src=\"/static/media/data_tools/jupyter_screenshot.png\" alt=\"\"></p>\n<p><a href=\"doc:jupyter\">Подробнее про использование Jupyter</a></p>\n<h1 id=\"-clickhouse-client\">Консольная утилита clickhouse-client</h1>\n<p>В ClickHouse довольно специфичный вид SQL, но в тоже время он дико быстрый и очень круто подходит для аналитических запросов. Поддерживает параметрические агрегатные функции, проверку последовательности действий и много, много, много другого.</p>\n<p><img src=\"/static/media/data_tools/clickhouse_client.png\" alt=\"\"></p>\n<p>На самом деле, с SQL очень легко, немного разобравшись, можно научиться вытаскивать сложнейшие показатели. SQL запросы к ClickHouse можно выполнять и в Jupyter.</p>\n<p>Консольная утилита clickhouse доступна в терминале вашего сервера.</p>\n<pre><code>clickhouse-client</code></pre><h1 id=\"mixpanel\">Mixpanel</h1>\n<p>Это крайне удобный сервис для работы с данными. Там очень недостает сессионных данных, но мы это исправили, и при подключении Mixpanel через Rockstat там будет подробная информация о сессиях. Более того, бесплатной версии (20м datapoints) может многим хватить. К сожалению, идентифицировать можно всего 1000, по этой причине они не передаются. Данные передаются через API, соответственно, никакой дополнительный код не устанавливается</p>\n<p><img src=\"/static/media/data_tools/mixpanel_screenshot.png\" alt=\"\"></p>\n<h1 id=\"-\">Другие инструменты</h1>\n<p>Важно понимать, что вы можете использовать любые другие инструменты для работы с данными, ведь это ваши данные, ваше хранилище, ваш сервер и нет ограничений. Берете любой другой инструмент, либо устанавливаете его на сервере, либо используете на своем компьютере, просто подключившись к хранилищу.</p>\n"}